// напишите программу которая на вход примет число и выдаст ее квадрат
int num;

Console.Write("Введите число: ");

num = Convert.ToInt32(Console.ReadLine());
int square = num*num;

Console.WriteLine("квадрат введенного числа: "+ square);

